---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.HighlightedElementFamRefsInvalidWarning
source: html/6bda1685-6e4b-eab9-d907-a293692ec145.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.HighlightedElementFamRefsInvalidWarning Property

One or more references of the highlighted element have become invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId HighlightedElementFamRefsInvalidWarning { get; }
```